OpenFOAM_Maincode/tutorials/multiphaseEuler/wallBoilingIATE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    length  3.5;
    rA     0.0096;
    lengthCells 350;
    rAcells 40;
}

convertToMeters 1;

vertices
(
    (                      0                   0 -1)
    ($!backgroundMesh/length                   0 -1)
    (                      0 $!backgroundMesh/rA -1)
    ($!backgroundMesh/length $!backgroundMesh/rA -1)

    (                      0                   0  0)
    ($!backgroundMesh/length                   0  0)
    (                      0 $!backgroundMesh/rA  0)
    ($!backgroundMesh/length $!backgroundMesh/rA  0)
);

blocks
(
    hex (0 1 3 2 4 5 7 6)
    ($!backgroundMesh/lengthCells $!backgroundMesh/rAcells 1)
    simpleGrading (1 0.5 1)

);

boundary
(
    inlet
    {
        type mappedInternal;
        offset (0.05 0 0);
        faces
        (
            (0 4 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 7 3)
        );
    }
    front
    {
        type symmetry;
        faces
        (
            (4 5  7 6)
        );
    }

    back
    {
        type symmetry;
        faces
        (
            (0 1 3 2)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (3 2  6  7)
            (1 0  4  5)
        );
    }
);


// ************************************************************************* //
